Repository: Carleslc/fountains_app
Catalog: lib/l10n/app_*.arb
Languages: ca, es

# appTitle
source: Fountains Finder
ca: Buscador de fonts
es: Buscador de fuentes

source: Fountain
ca: Font
es: Fuente

# fountainFee
source: Requires a payment
ca: Es requereix un pagament
es: Se requiere un pago

# fountainTypeTapWaterPublic
source: Public fountain
ca: Font pública
es: Fuente pública

# fountainTypeTapWaterPrivate
source: Private fountain
ca: Font privada
es: Fuente privada

# fountainTypeNatural
source: Natural spring
ca: Font natural
es: Fuente natural

# fountainTypeWaterPoint
source: Water point
ca: Punt de subministrament
es: Punto de suministro

# fountainTypeWateringPlace
source: Watering place
ca: Abeurador
es: Abrevadero

# fountainTypeUnknown
source: Unknown fountain
ca: Font desconeguda
es: Fuente desconocida

# safeWater
source: Drinking water
ca: Aigua potable
es: Agua potable

# safeWaterYes
source: Yes
ca: Sí
es: Sí

# safeWaterProbably
source: Yes (Probably)
ca: Sí (Probablement)
es: Sí (Probablemente)

source: Unknown
ca: Desconegut
es: Desconocido

# legalWaterTreated
source: Treated water approved by public authorities
ca: Aigua tractada sanitàriament
es: Agua tratada

# legalWaterUntreated
source: Water is untreated
ca: Aigua sense tractar
es: Agua sin tratar

source: Access
ca: Accés
es: Acceso

# fountainAccessPublic
source: Public
ca: Públic
es: Público

# fountainAccessPermissive
source: Permissive
ca: Permès
es: Permitido

# fountainAccessCustomers
source: Customers only
ca: Només per clients
es: Solo para clientes

# fountainAccessPermit
source: Requires a permit
ca: Es necessita un permís
es: Se necesita un permiso

# fountainAccessPrivate
source: Private
ca: Privat
es: Privado

# fountainAccessRestricted
source: Restricted
ca: Restringit
es: Restringido

# operationalStatusNotWorking
source: Not working
ca: No funciona
es: No funciona

# operationalStatusNoWater
source: No water
ca: No té aigua
es: No tiene agua

# moreInfo
source: More information
ca: Més informació
es: Más información

# accessibleWheelchair
source: Accessible with wheelchair
ca: Accesible amb cadira de rodes
es: Accesible con silla de ruedas

# notAccessibleWheelchair
source: Not accessible with wheelchair
ca: No accesible amb cadira de rodes
es: No accesible con silla de ruedas

# accessiblePets
source: Accessible for pets
ca: Accesible per mascotes
es: Accesible para mascotas

# notAccessiblePets
source: Not accessible for pets
ca: No accesible per mascotes
es: No accesible para mascotas

# accessibleBottles
source: Easy to refill bottles
ca: És fàcil omplir ampolles
es: Fácil rellenado de botellas

# notAccessibleBottles
source: Not easy to refill bottles
ca: No es poden omplir ampolles fàcilment
es: No se pueden rellenar botellas fácilmente

source: North rotation
ca: Rotació nord
es: Rotación norte

source: Center location
ca: Centrar ubicació
es: Centrar ubicación

# zoomMessage
source: Zoom in to show fountains
ca: Fes més zoom per buscar fonts
es: Haz más zoom para buscar fuentes

source: Fetching fountains...
ca: Obtenint fonts...
es: Obteniendo fuentes...

# fountainsError
source: Error fetching fountains
ca: Error a l'obtenir fonts
es: Error al obtener las fuentes

# fountainsNetworkError
source: Could not fetch fountains
ca: No s'han pogut obtenir les fonts
es: No se han podido obtener las fuentes

# updatingLocation
source: Obtaining location...
ca: Obtenint ubicació...
es: Obteniendo ubicación...

# locationError
source: Cannot obtain location
ca: No s'ha pogut obtenir la ubicació
es: No se ha podido obtener la ubicación

# continueButton
source: Continue
ca: Continuar
es: Continuar

source: Enable
ca: Activar
es: Activar

source: Allow
ca: Permetre
es: Permitir

# locationServicesDisabled
source: Location services are disabled.
ca: La ubicació GPS està desactivada.
es: La ubicación GPS está desactivada.

source: Location permissions denied.
ca: S'han denegat els permisos d'ubicació.
es: Se han denegado los permisos de ubicación.

source: Location permissions
ca: Permissos d'ubicació
es: Permisos de ubicación

# locationPermissionsUsage
source: Please allow location permissions to see your location in the map.
ca: Has d'acceptar els permisos de localització per poder veure la teva ubicació al mapa.
es: Debes permitir el uso de la localización para ver tu ubicación en el mapa.

# noConnection
source: No internet connection
ca: Sense connexió a Internet
es: Estás sin conexión

# noConnectionCheck
source: No internet connection. Check your connection to fetch fountains.
ca: No tens connexió a Internet. Comprova la teva connexió per mostrar fonts.
es: No tienes conexión a Internet. Verifica tu conexión para mostrar fuentes.

# connectionLost
source: Internet connection lost
ca: S'ha perdut la connexió a Internet
es: Se ha perdido la conexión a Internet

# connectionResumed
source: You have internet connection again
ca: Tornes a tenir connexió
es: Vuelves a tener conexión

source: Navigation error
ca: No s'ha pogut mostrar la pantalla
es: No se ha podido mostrar la pantalla

# imageLoading
source: Loading image...
ca: Carregant imatge...
es: Cargando imagen...

# imageError
source: Cannot load image
ca: No s'ha pogut carregar la imatge
es: No se ha podido cargar la imagen

source: Back to map
ca: Tornar al mapa
es: Volver al mapa

# urlError
source: Cannot open url: {url}
ca: No es pot obrir l'enllaç: {url}
es: No se puede abrir el enlace: {url}

source: Go
ca: Anar
es: Ir

# openIn
source: Open in {app}
ca: Obrir a {app}
es: Abrir en {app}

# cannotOpen
source: Cannot open {app}
ca: No s'ha pogut obrir {app}
es: No se ha podido abrir {app}

source: About
ca: Informació
es: Información

# aboutDescriptionTitle
source: Description
ca: Descripció
es: Descripción

# aboutDescription
source: Access to drinking water is essential for health, a fundamental human right, and a key aspect of effective health protection policies. This app helps users find public drinking water sources, supporting efforts towards sustainable development and the protection of this vital resource.
ca: L'accés a aigua potable és essencial per a la salut, un dret humà fonamental i un aspecte clau de les polítiques de protecció de la salut. Aquesta aplicació ajuda els usuaris a trobar fonts públiques d'aigua potable, dirigint els esforços cap al desenvolupament sostenible i la protecció d'aquest recurs vital.
es: El acceso a agua potable es esencial para la salud, un derecho humano fundamental y un aspecto clave de las políticas de protección de la salud. Esta aplicación ayuda a los usuarios a encontrar fuentes públicas de agua potable, dirigiendo los esfuerzos hacia el desarrollo sostenible y la protección de este recurso vital.

# aboutTermsTitle
source: Terms and conditions
ca: Condicions d'ús
es: Condiciones de uso

# aboutTerms
source: We advise all users to use their own discretion and judgment before drinking water from any of the fountains or water points referenced in this application. It is important that users, especially those planning itineraries, do not rely solely on the information provided by the application. We recommend contacting local tourist offices or other residents of the areas they plan to visit to confirm the availability of drinking water on their route. Although we do our best to record all available water sources and keep our data as up-to-date as possible through information provided by OpenStreetMap, user reports, and data supplied by some municipalities, we cannot guarantee that the information provided is always accurate or up-to-date. The location of the fountains may not be correct, the fountains may not be operational or may not have water, and we cannot ensure that the water is safe to drink. If you find any errors or outdated information, we encourage you to report it in the fountain information to help the application display the most accurate data possible about each fountain at any given time. The application is not affiliated with or related to any municipalities, responsible companies, manufacturers, or distributors of the water fountains. We do not assume any responsibility for the quality, availability, or potability of the water from the fountains listed in the application. The use of this application implies acceptance of these terms. The use of the fountains listed in the application is at your own risk, and the developers will not be responsible for any damage or harm resulting from the use of the information provided.
ca: Aconsellem a tots els usuaris que utilitzin el seu propi criteri i judici abans de beure aigua de qualsevol de les fonts o punts d'aigua referenciats en aquesta aplicació. És important que els usuaris, especialment aquells que planifiquen itineraris, no depenguin exclusivament de la informació proporcionada per l'aplicació. Recomanem contactar amb les oficines de turisme locals o altres habitants de les àrees que planegin visitar per confirmar la disponibilitat d'aigua potable en la seva ruta. Tot i que fem tot el possible per registrar totes les fonts d'aigua disponibles i mantenim les nostres dades actualitzades en la mesura del possible mitjançant la informació proporcionada per OpenStreetMap, informes d'usuaris i dades subministrades per alguns ajuntaments, no podem garantir que la informació proporcionada sigui sempre precisa o estigui actualitzada. La ubicació de les fonts pot no ser correcta, les fonts poden no estar en funcionament o no tenir aigua, i no podem assegurar que l'aigua sigui potable. Si trobeu algun error o informació desactualitzada, us animem a reportar-ho en la informació de la font per ajudar a que l'aplicació mostri dades el més encertades possibles sobre cada font en cada moment. L'aplicació no està afiliada ni té relació amb cap ajuntament, empreses encarregades, fabricants o distribuïdores de les fonts d'aigua. No assumim cap responsabilitat per la qualitat, disponibilitat o potabilitat de l'aigua de les fonts llistades en l'aplicació. L'ús d'aquesta aplicació implica l'acceptació d'aquestes condicions. L'ús de les fonts llistades en l'aplicació és sota la vostra pròpia responsabilitat, i els desenvolupadors no seran responsables de cap dany o perjudici derivat de l'ús de la informació proporcionada.
es: Aconsejamos a todos los usuarios utilizar su propio criterio y juicio antes de beber agua de cualquiera de las fuentes o puntos de agua referenciados en esta aplicación. Es importante que los usuarios, especialmente aquellos que planifican itinerarios, no dependan exclusivamente de la información proporcionada por la aplicación. Recomendamos contactar a las oficinas de turismo locales u otros habitantes de las áreas que planeen visitar para confirmar la disponibilidad de agua potable en su ruta. Aunque hacemos todo lo posible por registrar todas las fuentes de agua disponibles y mantenemos nuestros datos actualizados en la medida de lo posible mediante la información proporcionada por OpenStreetMap, reportes de usuarios y datos suministrados por algunos ayuntamientos, no podemos garantizar que la información proporcionada sea siempre precisa o esté actualizada. La ubicación de las fuentes puede no ser correcta, las fuentes pueden no estar en funcionamiento o no tener agua, y no podemos asegurar que el agua sea potable. Si encuentra algún error o información desactualizada, le alentamos a reportarlo en la información de la fuente para ayudar a que la aplicación muestre datos lo más acertados posibles sobre cada fuente en cada momento. La aplicación no está afiliada ni tiene relación alguna con los ayuntamientos, empresas encargadas, fabricantes o distribuidoras de las fuentes de agua. No asumimos ninguna responsabilidad por la calidad, disponibilidad o potabilidad del agua de las fuentes listadas en la aplicación. El uso de esta aplicación implica la aceptación de estas condiciones. El uso de las fuentes listadas en la aplicación es bajo su propia responsabilidad, y los desarrolladores no serán responsables por ningún daño o perjuicio derivado del uso de la información proporcionada.

# aboutVersionTitle
source: App version
ca: Versió de l'aplicació
es: Versión de la aplicación

# aboutAttributionsTitle
source: Attributions
ca: Atribucions
es: Atribuciones

# attributionOpenStreetMap
source: This application uses data from OpenStreetMap, a global geographic database created by volunteers. You can edit information and add drinking water sources directly on OpenStreetMap. If you modify OpenStreetMap data, the changes will be reflected in this application within 24 hours.
ca: Aquesta aplicació utilitza dades de OpenStreetMap, una base de dades geogràfiques mundial creada per voluntaris. Pots editar informació i afegir fonts directament a OpenStreetMap. Si modifiques dades de OpenStreetMap, els canvis es veuran reflectits en aquesta aplicació en un màxim de 24 hores.
es: Esta aplicación utiliza datos de OpenStreetMap, una base de datos geográfica mundial creada por voluntarios. Puedes editar información y añadir fuentes directamente en OpenStreetMap. Si modificas datos de OpenStreetMap, los cambios se verán reflejados en esta aplicación en un plazo máximo de 24 horas.

# attributionProviders
source: Other data providers for water sources
ca: Altres proveïdors de dades sobre fonts d'aigua
es: Otros proveedores de datos sobre fuentes de agua

# attributionFreepik
source: Some images used in this application have been obtained from Freepik.
ca: Algunes imatges utilitzades en aquesta aplicació han estat obtingudes de Freepik.
es: Algunas imágenes utilizadas en esta aplicación han sido obtenidas de Freepik.

# attributionIcons
source: The icons used in this application are from {icons}.
ca: Les icones utilitzades en aquesta aplicació són de {icons}.
es: Los iconos utilizados en esta aplicación han sido obtenidos de {icons}.
